[
	[
		{
			"title": "Plague Clinic",
			"images": [
				"plagueClinicStart.jpg",
				"plagueClinicBox.jpg",
				"plagueClinicWiring.jpg"
			],
			"description": "In Plague Clinic, the player treats patients suffering from common diseases in the Middle Ages. The player uses a special box controller - \"The Doctor's Kit\" - that indicates the time countdown for the task with colored lights and allows the user to use potions, acupuncture, and other elements. This interactive experience was developed for Swamp Hacks where my team and I won best In-Theme Award (1/2022 - 1/2022)",
			"tech": "Unity, C#, Arduino, RFID Tags, LCD display, rotary encoders, and potentiometers",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/jaberrio/Doctor"
				},
				{
					"name": "Video Presentation",
					"link": "https://www.youtube.com/watch?v=CaYwqcP5R2s"
				},
				{
					"name": "Devpost Submission",
					"link": "https://devpost.com/software/plague-clinic"
				}

			]
			},
		{
		"title": "Tweet Crack ",
		"images": [
			"gameplay_screen.png",
			"main.png",
			"Screenshot 2021-12-24 041516.png"
		],
		"description": "TweetCrack is a mobile trivia game where players get to guess which person said a certain tweet. The game features different trending categories such as sports, politics, health, news, etc. After selecting a category the user will be presented with a series of tweets, each with its own list of possible Twitter users. Each round consists of 5 tweets and each time the player guesses all 5 users correctly they earn a special badge for that category. The more times they win, the more badges they collect. Collect as many badges as possible to become a verified twitter master! (11/2021 - 12/2021)",
		"tech": "Java, Android Studio, Twitter API",
		"links": [
			{
				"name": "Source Code",
				"link": "https://github.com/erik-rosa/TweetCrack"
			},
			{
				"name": "Download Via Google Play",
				"link": "https://play.google.com/store/apps/details?id=com.Peyton.tweetcrack"
			}
		]
		},
		{
			"title": "TPED Dark Ride",
			"images": [
				"TPED_LOGO.png"
			],
			"description": "The TPED Ride design team is developing a prototype dark ride: A trackless ride system with a drop tower element. There will be 2 scaled prototypes of the ride vehicle: a larger prototype large enough to fit in all the features desired and a smaller prototype capable of moving through an entire ride model. The trackless ride system will make use of an LPS system using ultrasonic sensors and the vehicle will be capable of moveing in any direction using Mecanum Wheels. I am the Lead Design team captain and have Created a project plan for the project and is responsible for designated deliverables to the team. (10/21 - current)",
			"tech": "Arduino, Raspberry Pi, C++, Motors, Sensors",
			"links": [
				{
					"name": "TPED Website",
					"link": "https://gatortped.wixsite.com/home"
				}
			]
			},	
		{
			"title": "Optum SWE Internship",
			"images": [
				"optum.png"
			],
			"description": "During this 10 week internship I monitored and maintained in production software that assigns agents with active jobs. I developed JavaScript scripts and a react dashboard to analyze metrics from data that were pulled from 3rd party applications. I displayed these metrics in the React application allowing my system administrator to see how the backend is doing in real time (05/2021 - 08/2021)",
			"tech": "ServiceNow, Grafana, Splunk, JavaScript, React.JS ",
			"links": [
				{
					"name": "End of Internship Powerpoint",
					"link": "https://uflorida-my.sharepoint.com/:p:/g/personal/pmarinelli_ufl_edu/EVrDEwbXdRlLh9Vh0_S4xJAB_A8dtLJ7Aixz9wVelrHNVA?e=bHZUIW"
				}
			]
		},
		{
			"title": "Interactive Battleship",
			"images": [
				"InteractiveBattleship.png",
				"InteractiveBattleshipPhysical.jpg",
				"InteractiveBattleshipHome.jpg",
				"InteractiveBattleshipCannonMinigame.jpg",
				"InteractiveBattleshipHackingMinigame.jpg",
				"InteractiveBattleshipPhysical2.jpg",
				"InteractiveBattleshipBoat.jpg"
			],
			"description": "Interactive battleship is an immersive, multiplayer battleship themed experience. Opponents will compete in offensive and defensive mini games to attack each other’s ship until someone sinks the other ship and wins. The game consists of a mobile app and a physical boat prop that can react to the player’s moves in the game through augmented reality and other special effects like LEDs and motors. (01/2021 - 05/2021)",
			"tech": "Raspberry Pi, GoLang, C#, Unity, Python, TCP, MySQL",
			"links": [
				{
					"name": "Server/Physical Source Code",
					"link": "https://github.com/pmarinelli18/SeniorDesign"
				},
				{
					"name": "Mobile App Source Code",
					"link": "https://github.com/pmarinelli18/BattleshipApp"
				},
				{
					"name": "Presentation/Demo",
					"link": "https://www.youtube.com/watch?v=RmgGLRsu9t4"
				}
			]
		},
		{
			"title": "Soverign Skies",
			"images": [
				"SovLogo.png",
				"SS_StartScreen.png",
				"SS_StoreScreen.png",
				"SS_Game1.png",
				"SS_Game2.png"
			],
			"description": "Sovereign skies is a 2D top down shooter with a retro WW2 theme. The objective is to take down waves of enemy planes while surviving to progress from level to level. Unlock planes and upgrade abilities using stars earned from each level. (8/20 - 12/20)",
			"tech": "Python, Pyglet",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/ahsanrohan/SovSkies"
				},
				{
					"name": "Download Executable",
					"link": "SoverignSkies.zip"
				},
				{
					"name": "Demo",
					"link": "https://www.youtube.com/watch?v=4lquB7gf3s8&feature=youtu.be"
				}
			]
		},
		{
			"title": "TPED Coaster",
			"images": [
				"CoasterControlBoard.png",
				"DT_A_Overview.png",
				"ChalkDesign.jpeg",
				"ControlPanelDesign1.jpeg",
				"TPEDCoasterDesign.PNG"
			],
			"description": " The Theme Park Engineering and Design Club is working on a small scale working roller coaster. My team is working on the controls for the coaster; We are programming an arduino to maintain block sections and dispatch trains. (8/19 - current)",
			"tech": "Arduino, hardware including motors, sensors, switches, ect.",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/pmarinelli18/TPEDCoasterControlsFall2019"
				},
				{
					"name": "Design Team Website",
					"link": "https://gatortped.wixsite.com/home/blank-page-4"
				}
			]
		},
		{
			"title": "Neurosurgery Website",
			"images": [
				"FinalPhoto1.png",
				"S20_7_Neuro6_1.gif",
				"S20_7_Neuro6_2.gif",
				"S20_7_Neuro6_3.gif"
			],
			"description": "My team and I developed a web app for the UF Neurosurgery department to allow patients and admins to request, view, and add appointments. The app allows patients to create an account, view upcoming appointments and reminders, view contact and clinic location information, and request new appointments. The app also allows admins to create an account, view current patient and appointment information, approve appointments, and create new appointments. (You may log on to the test site with the email: admin@admin.com and password: admin for admin or email: test@test.com and password: test for general user) (1/20 - 5/20)",
			"tech": "MongoDB, Express.js, React.js, Node.js, ANT Design, CRUD, Crypto, node-cron, Google Maps API, Mailgun and twilio",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/AlyssaMarotta/Neuro6"
				},
				{
					"name": "Test Site",
					"link": "http://neuro6.herokuapp.com/Home"
				}
			]
		}
	],
	[
		{
			"title": "Look After",
			"images": ["LookAfter.png", "LookAfterHome.png", "LookAfterStart.png"],
			"description": "Social media can sometimes be a toxic environment. Without proper attention, friends and family can be consumed by the compiled negativity. This application aims to take a deeper look at the users emotions and personality while pointing out instances where they may not have been healthy in conversation. Look After tries to promote healthy conversation by providing a URL to the users messages. In development we used ASP.net MVC in combination with the Twitter API and the Google Natural Language Processing API. We also used multiple studies and datasets based on the big 5 personality traits and 6 emotions to analyze and interpret the data returned from the APIs. (9/20)",
			"tech": "ASP.net, C#, Google-cloud-language, javascript, mvc, twitterAPI, Bootstrap",
			"links": [
				{
					"name": "Source Code",
					"link": "https://dev.azure.com/mimmam/_git/Tweeter-Tweet-Tracker-2.0?path=%2F&version=GBmaster&_a=contents"
				},
				{
					"name": "Test Site",
					"link": "https://lookafter.azurewebsites.net/"
				}
			]
		},
		{
			"title": "Silent Disco",
			"images": ["SilentDiscoStart.png", "SilentDiscoHome.png"],
			"description": "My team and I developed the User interface of a mobile app that would allow users to listen to the same song simultaneously over different devices. We gathered data from surveys of potential users in order to find the most ideal layout. (4/20 - 5/20)",
			"tech": "react-native, react-navigation, ",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/pmarinelli18/SilentDiscoApp"
				},
				{
					"name": "Video Demonstration",
					"link": "https://www.youtube.com/watch?v=OR3A-i0Y12c&t=0s"
				}
			]
		},
		{
			"title": "Pascal Interpreter(Haskell)",
			"images": ["PascalInHaskell.png"],
			"description": "In this project, I implement a similar programming language to pascal using Haskell. This program is written in functional programming in a tree like fashion (4/20)",
			"tech": "Haskell, Cabal, Forth ",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/pmarinelli18/Project3Dobra"
				}
			]
		},
		{
			"title": "Lend an Eye",
			"images": ["lendaneye1.PNG", "LAE1.jpg"],
			"description": "In modern day, its become increasingly difficult for some members of society to keep up with the ever-increasing density of news and information. This desktop application was designed to help inform individuals who find it difficult to read news articles like the elderly or people who dont speak the written language. (This project was awarded Best use of Google Cloud at Hack FSU 2019) (3/20)",
			"tech": "C#, Google Cloud Services, Google Language API, Microsoft Azure, and Bing API",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/pmarinelli18/grape"
				},
				{
					"name": "Devpost Submission",
					"link": "https://devpost.com/software/grape-yz14ld"
				}
			]
		},
		{
			"title": "Text Adventure Design",
			"images": ["textadventure.png"],
			"description": "My team and I developed the design of a OOP framework for Text Adventure video games. We incorporated object oriented programming patterns in places that made sense (4/20 - 5/20)",
			"tech": "N/A ",
			"links": [
				{
					"name": "Google Doc",
					"link": "https://docs.google.com/document/d/13_HJUcWRvp6wceIT5lGK1Ucv-kKCUDFbWZMEy43expw/edit?usp=sharing"
				}
			]
		},
		{
			"title": "Twitter Tweet Tracker",
			"images": ["NasaScreenshot.PNG", "CnnTTT.jpg", "ElonMuskTTT.jpg"],
			"description": "Twitter Tweet Tracker takes in tweet and follower data from individuals and generates a five-personality model, six emotion model, subjectivity bar, frequency table, and various tweet charts. This application is deisgned to identify at risk or unsable twitter users. Using word analysis and key context clues, we can create a model of a twitter user who might be experiencing distress and other abnormal emotional spikes. Because of the rapid nature of twitter, it can be hard for individuals to keep track of their friends when they need them the most. Thus, this application can help users in keeping up with their friends over larger periods of time. (9/19)",
			"tech": "C#, .netframework, restfull, tweetinvi",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/jaberrio/Toast2.0_SH19"
				}
			]
		},
		{
			"title": "Pascal Interpreter(Java)",
			"images": ["antlr4_parse_tree2.png"],
			"description": "In this project, I implement a similar programming language to pascal using Java. This program is written in functional programming in a tree like fashion (3/20)",
			"tech": "Java, Antlr",
			"links": [
				{
					"name": "Source Code",
					"link": "https://github.com/Josequintas96/Proj2"
				}
			]
		},
		{
			"title": "Old Projects",
			"images": ["minesweeper.png", "thedragondailyaug9page1.png"],
			"description": "Some older projects I worked on in high school and my first years of college include developing the Stranahan High School website, Creating the Stranahan High School Newsletter, developing the idea and an early prototype for a mobile detention recorder, developing the idea for a visual announcements that can be accessed online, developing a business to undercut the compition for large scale printing by working in house within the high school, and lastly the redevelopement of the computer game minesweeper. (Many things have changed from the High School Website although the format still remains the same) (2017 - 2018)",
			"tech": "C++, SFML",
			"links": [
				{
					"name": "High School Projects",
					"link": "https://fixingstranahanproblems.weebly.com/"
				},
				{
					"name": "Minesweeper Source Code",
					"link": "https://github.com/pmarinelli18/Minesweeper"
				}
			]
		}
	]
]
